
- **products** - Items sold in the store
- **customers** - People who buy products
- **orders** - Records of purchases

In [1]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect('store.db')

# Helper function to run SQL queries
def run_sql(query):
    return pd.read_sql_query(query, conn)

print("Connected to database!")

Connected to database!

Get the table

In [2]:
# View the products table
run_sql("SELECT * FROM products")

    product_id   product_name     category   price  stock_quantity
0            1         Laptop  Electronics  999.99              50
1            2     Smartphone  Electronics  699.99             100
2            3     Headphones  Electronics  149.99             200
3            4   Coffee Table    Furniture  249.99              30
4            5   Office Chair    Furniture  199.99              45
5            6      Bookshelf    Furniture  129.99              25
6            7  Running Shoes       Sports   89.99              80
7            8     Basketball       Sports   29.99              60
8            9       Yoga Mat       Sports   39.99             100
9           10   Water Bottle       Sports   19.99             150
10          11      Desk Lamp  Electronics   49.99              75
11          12   Gaming Mouse  Electronics   79.99              90

In [3]:
# View the customers table
run_sql("SELECT * FROM customers")

   customer_id first_name last_name                 email         city
0            1       John     Smith  john.smith@email.com     New York
1            2      Sarah   Johnson     sarah.j@email.com  Los Angeles
2            3       Mike  Williams      mike.w@email.com      Chicago
3            4      Emily     Brown     emily.b@email.com      Houston
4            5      David     Jones     david.j@email.com     New York
5            6       Lisa    Garcia      lisa.g@email.com  Los Angeles
6            7      James    Miller     james.m@email.com      Seattle
7            8       Anna     Davis      anna.d@email.com      Chicago

In [4]:
# View the orders table
run_sql("SELECT * FROM orders")

    order_id  customer_id  product_id  quantity  order_date
0          1            1           1         1  2024-01-15
1          2            1           3         2  2024-01-15
2          3            2           2         1  2024-01-16
3          4            3           5         1  2024-01-17
4          5            4           7         2  2024-01-18
5          6            5           1         1  2024-01-19
6          7            6           9         3  2024-01-20
7          8            7           4         1  2024-01-21
8          9            8          12         2  2024-01-22
9         10            1          10         4  2024-01-23
10        11            2           6         1  2024-01-24
11        12            3           8         2  2024-01-25
12        13            4          11         1  2024-01-26
13        14            5           3         1  2024-01-27
14        15            6           2         1  2024-01-28

## Problem 1: SELECT All
**Question:** Get all columns from the `products` table.

**Hint:** Use `SELECT * FROM table_name`

In [5]:
#Write your answer here:
run_sql("""
        SELECT * FROM products
""")

    product_id   product_name     category   price  stock_quantity
0            1         Laptop  Electronics  999.99              50
1            2     Smartphone  Electronics  699.99             100
2            3     Headphones  Electronics  149.99             200
3            4   Coffee Table    Furniture  249.99              30
4            5   Office Chair    Furniture  199.99              45
5            6      Bookshelf    Furniture  129.99              25
6            7  Running Shoes       Sports   89.99              80
7            8     Basketball       Sports   29.99              60
8            9       Yoga Mat       Sports   39.99             100
9           10   Water Bottle       Sports   19.99             150
10          11      Desk Lamp  Electronics   49.99              75
11          12   Gaming Mouse  Electronics   79.99              90

---
## Problem 2: SELECT Specific Columns
**Question:** Get only the `product_name` and `price` from the products table.

**Hint:** List column names separated by commas

In [6]:
#Write your answer here:
run_sql("""
    SELECT price FROM products
""")

     price
0   999.99
1   699.99
2   149.99
3   249.99
4   199.99
5   129.99
6    89.99
7    29.99
8    39.99
9    19.99
10   49.99
11   79.99

---
## Problem 3: WHERE Clause
**Question:** Find all products in the 'Electronics' category.

**Hint:** Use `WHERE column = 'value'`

In [8]:
# Write your answer here:
run_sql("""
        SELECT * from products where category = 'Electronics'	
""")

   product_id  product_name     category   price  stock_quantity
0           1        Laptop  Electronics  999.99              50
1           2    Smartphone  Electronics  699.99             100
2           3    Headphones  Electronics  149.99             200
3          11     Desk Lamp  Electronics   49.99              75
4          12  Gaming Mouse  Electronics   79.99              90

---
## Problem 4: Comparison Operators
**Question:** Find all products with price greater than $100.

**Hint:** Use `WHERE price > 100`

In [9]:
# Write your answer here:
run_sql("""
        select * from products where price > 100
""")

   product_id  product_name     category   price  stock_quantity
0           1        Laptop  Electronics  999.99              50
1           2    Smartphone  Electronics  699.99             100
2           3    Headphones  Electronics  149.99             200
3           4  Coffee Table    Furniture  249.99              30
4           5  Office Chair    Furniture  199.99              45
5           6     Bookshelf    Furniture  129.99              25

---
## Problem 5: ORDER BY
**Question:** Get all products ordered by price from highest to lowest.

**Hint:** Use `ORDER BY column DESC`

In [10]:
#Write your answer here:
run_sql("""
    SELECT * FROM products 
    ORDER BY price DESC
""")

    product_id   product_name     category   price  stock_quantity
0            1         Laptop  Electronics  999.99              50
1            2     Smartphone  Electronics  699.99             100
2            4   Coffee Table    Furniture  249.99              30
3            5   Office Chair    Furniture  199.99              45
4            3     Headphones  Electronics  149.99             200
5            6      Bookshelf    Furniture  129.99              25
6            7  Running Shoes       Sports   89.99              80
7           12   Gaming Mouse  Electronics   79.99              90
8           11      Desk Lamp  Electronics   49.99              75
9            9       Yoga Mat       Sports   39.99             100
10           8     Basketball       Sports   29.99              60
11          10   Water Bottle       Sports   19.99             150

---
## Problem 6: LIMIT
**Question:** Get the top 3 most expensive products.

**Hint:** Combine `ORDER BY` and `LIMIT`

In [11]:
#Write your answer here:
run_sql("""
    SELECT * FROM products 
    ORDER BY price DESC
    LIMIT 3
""")

   product_id  product_name     category   price  stock_quantity
0           1        Laptop  Electronics  999.99              50
1           2    Smartphone  Electronics  699.99             100
2           4  Coffee Table    Furniture  249.99              30

---
## Problem 7: COUNT
**Question:** How many products are in each category?

**Hint:** Use `COUNT(*)` with `GROUP BY`

In [14]:
#Write your answer here:
run_sql("""
    SELECT category, count(category) as count_category from products
    group by category
""")

      category  count_category
0  Electronics               5
1    Furniture               3
2       Sports               4

---
## Problem 8: AVG (Average)
**Question:** What is the average price of all products?

**Hint:** Use `AVG(column)`

In [15]:
#Write your answer here:
run_sql("""
        SELECT AVG(price) FROM products
""")

   AVG(price)
0  228.323333

---
## Problem 9: SUM
**Question:** What is the total stock quantity for all Electronics products?

**Hint:** Use `SUM(column)` with `WHERE`

In [16]:
#Write your answer here:
run_sql("""
        select category,sum(price) as total_price
        from products
        group by category
""")

      category  total_price
0  Electronics      1979.95
1    Furniture       579.97
2       Sports       179.96

---
## Problem 10: JOIN (Combining Tables)
**Question:** Show all orders with customer first_name, last_name, and product_name.

**Hint:** Use `JOIN table ON condition`

In [23]:
#Write your answer here:
run_sql("""
SELECT o.order_id, c.first_name, c.last_name, p.product_name, o.quantity, o.order_date
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
JOIN products p ON o.product_id = p.product_id



""")

    order_id first_name last_name   product_name  quantity  order_date
0          1       John     Smith         Laptop         1  2024-01-15
1          2       John     Smith     Headphones         2  2024-01-15
2          3      Sarah   Johnson     Smartphone         1  2024-01-16
3          4       Mike  Williams   Office Chair         1  2024-01-17
4          5      Emily     Brown  Running Shoes         2  2024-01-18
5          6      David     Jones         Laptop         1  2024-01-19
6          7       Lisa    Garcia       Yoga Mat         3  2024-01-20
7          8      James    Miller   Coffee Table         1  2024-01-21
8          9       Anna     Davis   Gaming Mouse         2  2024-01-22
9         10       John     Smith   Water Bottle         4  2024-01-23
10        11      Sarah   Johnson      Bookshelf         1  2024-01-24
11        12       Mike  Williams     Basketball         2  2024-01-25
12        13      Emily     Brown      Desk Lamp         1  2024-01-26
13        14      David     Jones     Headphones         1  2024-01-27
14        15       Lisa    Garcia     Smartphone         1  2024-01-28

---
## Problem 11: AND / OR
**Question:** Find products that are in 'Electronics' category AND have a price less than $100.

**Hint:** Use `WHERE condition1 AND condition2`

In [ ]:
#Write your answer here:
run_sql("""

""")

---
## Problem 12: LIKE (Pattern Matching)
**Question:** Find all customers whose email contains 'email.com'.

**Hint:** Use `LIKE '%pattern%'` (% means any characters)

In [ ]:
# Write your answer here:
run_sql("""

""")